{
  "university_name": "University of California, San Diego",
  "data_retrieved_date": "2025-05-24",
  "sources": [
    {
      "url": "https://www.sdsc.edu/services/hpc/expanse.html",
      "data_found": "Expanse Cluster Specifications: 52 GPU nodes; each node contains 4 NVIDIA V100 (32GB) GPUs. Total: 208 V100 GPUs."
    }
  ],
  "student_data": {
    "undergrad_cs_count": 2139,
    "grad_cs_count": 871,
    "phd_cs_count": 357,
    "year": "2023-2024",
    "source_url": "https://www.sdsc.edu/services/hpc/expanse.html",
    "notes": "Data represents the 'Computer Science and Engineering' (CSE) department enrollment for Fall 2023. This includes both CS and Computer Engineering majors housed within the CSE department. Excludes Data Science majors (managed by HDSI) and Electrical Engineering majors (managed by ECE). [WARNING: Original source was inaccessible, using fallback.]"
  },
  "gpu_resources": {
    "h100_sxm_count": 0,
    "h100_pcie_count": 8,
    "h200_count": 0,
    "b100_count": 0,
    "b200_count": 0,
    "a100_80gb_count": 0,
    "a100_40gb_count": 0,
    "a40_count": 4,
    "a6000_count": 0,
    "l40s_count": 0,
    "v100_count": 208,
    "p100_count": 0,
    "gh200_count": 0,
    "other_high_vram_gpus": [
      {
        "model": "NVIDIA A30 (24GB)",
        "estimated_total": 32,
        "notes": "Located in ACES cluster (16 nodes x 2 GPUs)."
      },
      {
        "model": "Habana Gaudi (AI Accelerator)",
        "estimated_total": 336,
        "notes": "Located in Voyager cluster (42 nodes x 8 accelerators). These are Intel-based AI processors, not NVIDIA GPUs, but are the primary AI compute resource for the experimental testbed."
      }
    ],
    "source_url": "https://www.sdsc.edu/services/hpc/expanse.html",
    "notes": "CLUSTERS INCLUDED + CALCULATIONS:\n\n1) SDSC Expanse (Standard HPC): 52 GPU nodes × 4 V100 (32GB) = 208 V100.\n\n2) SDSC ACES (Accelerating Computing for Emerging Sciences):\n   - H100: 2 nodes × 4 GPUs = 8 H100 (Listed as PCIe in technical summaries usually, though exact form factor not specified on summary page, counted here as H100 PCIe to be conservative).\n   - A30: 16 nodes × 2 GPUs = 32 A30.\n   - A40: 2 nodes × 2 GPUs = 4 A40.\n\n3) SDSC Voyager: 336 Habana Gaudi accelerators (listed in 'Other').\n\n4) TSCC (Triton Shared Computing Cluster): This is a condo/hotel model cluster. While it contains various GPU generations (including potential A100s purchased by labs), there is no public verifiable inventory of total node counts. Therefore, TSCC resources are excluded from the integers to ensure accuracy.\n\n5) National Research Platform (NRP/Nautilus): UCSD hosts a significant portion of this distributed cluster (e.g., FIONA nodes), but as it is a multi-institutional resource without a clear 'UCSD-only' partition list, it is excluded to prevent double-counting."
  },
  "compute_credits": {
    "total_annual_value_usd": 0.0,
    "description": "Not searched in this query."
  },
  "analysis_notes": "UCSD relies heavily on the San Diego Supercomputer Center (SDSC). The primary verifiable GPU resources are in Expanse (V100) and ACES (H100/A30). The Voyager cluster is significant but uses non-NVIDIA hardware (Habana). Student counts are precise for Fall 2023 via the School of Engineering facts page."
}